2024-2-4/d42736ec4d-STDY.org
#+INCLUDE: "../../prefix.org"

#+TITLE: python 学习                                 

容器序列：list, tuple, collections.deque可以存放不同类型的数据(因为存放的都是对象引用)
扁平序列：str, bytes, bytearray, memoryview, array.array, 只能容纳一种类型(存放值，更紧凑，但只能存放字符、字节和数值这种基础类型)

可变序列：list, bytearray, array.array, collections.deque, memoryview
不可变序：tuple, str, bytes

* 列表推导和生成器表达式

1. 列表推导的作用只有一个，生成列表。
2. 如果想生成其他类型的序列，生成器表达式最适用。
3. 生成器表达式背后遵守迭代器协议，可以逐个产出元素，而不是先建立一个完整的列表，然后再把
   这个列表传递给某个构造函数里。相当于list(list())
#+begin_src python :results output
  colors = ['black', 'white']
  sizes = ['S', 'M', 'L']
  for tshirt in ('%s%s'%(c, s) for c in colors for s in sizes):
      print(tshirt)

  print('%s%s'%(c, s) for c in colors for s in sizes) # 生成器表达式
  print(['%s%s'%(c, s) for c in colors for s in sizes]) # 列表推导
#+end_src

#+RESULTS:
: blackS
: blackM
: blackL
: whiteS
: whiteM
: whiteL
: <generator object <genexpr> at 0x7f8396ed0ac0>
: ['blackS', 'blackM', 'blackL', 'whiteS', 'whiteM', 'whiteL']

4. 也就是说，只要不是列表list，都应该适用生成器表达式
   
