2024-2-4/d42736ec4d-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python 学习</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">python 学习</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgedd1241">1. 列表推导和生成器表达式</a></li>
<li><a href="#org59d559a">2. 元组不仅仅是不可变的列表</a></li>
<li><a href="#orgcbb3573">3. 强大的切片以及其高级用法</a></li>
<li><a href="#org6446fab">4. 对序列使用 + 和 *</a></li>
<li><a href="#org70f73c5">5. 序列增量赋值 += 和 *=</a></li>
</ul>
</div>
</div>
<p>
容器序列：list, tuple, collections.deque可以存放不同类型的数据(因为存放的都是对象引用)
扁平序列：str, bytes, bytearray, memoryview, array.array, 只能容纳一种类型(存放值，更紧凑，但只能存放字符、字节和数值这种基础类型)
</p>

<p>
可变序列：list, bytearray, array.array, collections.deque, memoryview
不可变序：tuple, str, bytes
</p>

<div id="outline-container-orgedd1241" class="outline-2">
<h2 id="orgedd1241"><span class="section-number-2">1.</span> 列表推导和生成器表达式</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>列表推导的作用只有一个，生成列表。</li>
<li>如果想生成其他类型的序列，生成器表达式最适用。</li>
<li>生成器表达式背后遵守迭代器协议，可以逐个产出元素，而不是先建立一个完整的列表，然后再把
这个列表传递给某个构造函数里。相当于list(list())</li>
</ol>
<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold; font-style: italic;">colors</span> = [<span style="font-style: italic;">'black'</span>, <span style="font-style: italic;">'white'</span>]
  <span style="font-weight: bold; font-style: italic;">sizes</span> = [<span style="font-style: italic;">'S'</span>, <span style="font-style: italic;">'M'</span>, <span style="font-style: italic;">'L'</span>]
  <span style="font-weight: bold;">for</span> tshirt <span style="font-weight: bold;">in</span> (<span style="font-style: italic;">'%s%s'</span>%(c, s) <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> colors <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sizes):
      <span style="font-weight: bold;">print</span>(tshirt)

  <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'%s%s'</span>%(c, s) <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> colors <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sizes) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#29983;&#25104;&#22120;&#34920;&#36798;&#24335;</span>
  <span style="font-weight: bold;">print</span>([<span style="font-style: italic;">'%s%s'</span>%(c, s) <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> colors <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sizes]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21015;&#34920;&#25512;&#23548;</span>
</pre>
</div>

<ol class="org-ol">
<li>也就是说，只要不是列表list，都应该适用生成器表达式</li>
</ol>
</div>
</div>
