2024-2-4/d42736ec4d-STDY.org
* 元组不仅仅是不可变的列表
元组除了可以用作不可变的列表，还可以用于没有字段名的记录。
#+begin_src python :results output
  lax_coordinates = (33.9425, -118.408)
  city, year, pop, chg, area = ('Tokyo', 2003, 32450, 0.66, 8014)
  traveler_ids = [('USA', '31195855'), ('BRA', 'CE342567'), ('ESP', 'XDA205856')]

  for passport in sorted(traveler_ids):
      print('%s/%s'%passport)

  for country, _ in traveler_ids:
      print(country)
#+end_src

#+RESULTS:
: BRA/CE342567
: ESP/XDA205856
: USA/31195855
: USA
: BRA
: ESP

元组拆包：
拆包方式1：
city, year, pop, chg, area = ('Tokyo', 2003, 32450, 0.66, 8014)

拆包方式2：
for country, _ in traveler_ids:

1. 唯一拆包硬性要求，被可迭代对象中的元素数量必须要跟接收这些元素的元组的空档数一致。
2. 除非用*来忽略多余元素。
3. 最好辨认元组拆包的形式：平行赋值：
   #+begin_src python :results output
     lax_coordinates = (33.9425, -118.408)
     latitude, longitude = lax_coordinates # 元组拆包
     print(latitude)
   #+end_src

   #+RESULTS:
   : 33.9425
4. 不使用中间变量来交换也是用元组方式实现：
   a, b = b, a
5. 还可以用*运算符把一个可迭代对象拆开：
   #+begin_src python :results output
     print(divmod(20, 8))
     t = (20, 8)
     print(divmod(*t))
     quotient, remainder = divmod(*t)
     print((quotient, remainder))
   #+end_src

   #+RESULTS:
   : (2, 4)
   : (2, 4)
   : (2, 4)
6. 元组拆包实现函数多个返回值：
   #+begin_src python :results output
     # os.path.split = split(p)
     #  Split a pathname.  Returns tuple "(head, tail)" where "tail" is
     #  everything after the final slash.  Either part may be empty.
     import os
     _, filename = os.path.split('/home/yjl00405/.ssh/idrsa.pub')
     print(filename)
     print(_)
   #+end_src

   #+RESULTS:
   : idrsa.pub
   : /home/yjl00405/.ssh
7. 如果是国际化软件，_可能不是一个理想占位符，因为他是gettext.gettext函数的别名。
   其他情况仍是一个好的占位符。
8. 用 * 来处理：
   #+begin_src python :results output
     a, b, *reset = range(5)
     print((a, b, reset))
     a, *reset, b = range(5)
     print((a, b, reset))
     *reset, a, b = range(5)
     print((a, b, reset))
     a, b, *reset = range(3)
     print((a, b, reset))
     a, b, *reset = range(2)
     print((a, b, reset))
   #+end_src

   #+RESULTS:
   : (0, 1, [2, 3, 4])
   : (0, 4, [1, 2, 3])
   : (3, 4, [0, 1, 2])
   : (0, 1, [2])
   : (0, 1, [])
9. 嵌套元组拆包
   #+begin_src python :results output
     metro_areas = [
	 ('Tokyo', 'JP', 36.234, (35.345, 123.345)),
	 ('Tokyo2', 'JP2', 3.234, (3.345, 12.345)),
     ]

     fmt = '{:15} | {:9.4f} | {:9.4f}'
     for name, cc, pop, (latitude, longitude) in metro_areas:
	 print(fmt.format(name, latitude, longitude))
   #+end_src

   #+RESULTS:
   : Tokyo           |   35.3450 |  123.3450
   : Tokyo2          |    3.3450 |   12.3450
10. 元组缺少一个给记录中字段命名的功能，namedtuple函数的出现可以帮我们解决这个问题：
    collections.namedtuple是一个工厂函数，它可以用来构建一个带字段名的元组和一个有名字的类，
    这个带名字的类对调试程序有很大的帮助。
    #+begin_src python :results output
      from collections import namedtuple
      # 类名， 类中各字段名
      City = namedtuple('City', 'name country population coordinates')
      tokyo = City('Tokyo', 'JP', 36.345, (35.456, 123,345))
      print(tokyo)
      # City(name='Tokyo', country='JP', population=36.345, coordinates=(35.456, 123, 345))

      print(tokyo.population)
      print(tokyo[0])

      print(City._fields)

      LatLong = namedtuple('LatLong', 'lat long')
      delhi_data = ('Delhi NCR', 'IN', 21.934, LatLong(28.34523, 77.20234))
      delhi = City._make(delhi_data)
      print(delhi._asdict())
      # {'name': 'Delhi NCR', 'country': 'IN', 'population': 21.934, 'coordinates': LatLong(lat=28.34523, long=77.20234)}
      
      print(delhi._asdict().items())
      # dict_items([('name', 'Delhi NCR'), ('country', 'IN'), ('population', 21.934), ('coordinates', LatLong(lat=28.34523, long=77.20234))])

      for key, value in delhi._asdict().items():
	  print(key+':', value)
    #+end_src

    #+RESULTS:
    #+begin_example
    City(name='Tokyo', country='JP', population=36.345, coordinates=(35.456, 123, 345))
    36.345
    Tokyo
    ('name', 'country', 'population', 'coordinates')
    {'name': 'Delhi NCR', 'country': 'IN', 'population': 21.934, 'coordinates': LatLong(lat=28.34523, long=77.20234)}
    dict_items([('name', 'Delhi NCR'), ('country', 'IN'), ('population', 21.934), ('coordinates', LatLong(lat=28.34523, long=77.20234))])
    name: Delhi NCR
    country: IN
    population: 21.934
    coordinates: LatLong(lat=28.34523, long=77.20234)
    #+end_example
11. _fields属性是一个包含这个类所有字段名的元组
12. _make()通过接收一个可迭代对象来生成这个类的一个实例，作用和City(*delhi_data)一样
13. _asdict()把具名元组以collections.OrderedDict的形式返回，我们可以利用它来把元组里的
    信息友好呈现出来。

