2024-2-4/d42736ec4d-STDY.html

<div id="outline-container-org59d559a" class="outline-2">
<h2 id="org59d559a"><span class="section-number-2">2.</span> 元组不仅仅是不可变的列表</h2>
<div class="outline-text-2" id="text-2">
<p>
元组除了可以用作不可变的列表，还可以用于没有字段名的记录。
</p>
<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold; font-style: italic;">lax_coordinates</span> = (33.9425, -118.408)
  <span style="font-weight: bold; font-style: italic;">city</span>, <span style="font-weight: bold; font-style: italic;">year</span>, <span style="font-weight: bold; font-style: italic;">pop</span>, <span style="font-weight: bold; font-style: italic;">chg</span>, <span style="font-weight: bold; font-style: italic;">area</span> = (<span style="font-style: italic;">'Tokyo'</span>, 2003, 32450, 0.66, 8014)
  <span style="font-weight: bold; font-style: italic;">traveler_ids</span> = [(<span style="font-style: italic;">'USA'</span>, <span style="font-style: italic;">'31195855'</span>), (<span style="font-style: italic;">'BRA'</span>, <span style="font-style: italic;">'CE342567'</span>), (<span style="font-style: italic;">'ESP'</span>, <span style="font-style: italic;">'XDA205856'</span>)]

  <span style="font-weight: bold;">for</span> passport <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">sorted</span>(traveler_ids):
      <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'%s/%s'</span>%passport)

  <span style="font-weight: bold;">for</span> country, _ <span style="font-weight: bold;">in</span> traveler_ids:
      <span style="font-weight: bold;">print</span>(country)
</pre>
</div>

<p>
元组拆包：
拆包方式1：
city, year, pop, chg, area = ('Tokyo', 2003, 32450, 0.66, 8014)
</p>

<p>
拆包方式2：
for country, _ in traveler_ids:
</p>

<ol class="org-ol">
<li>唯一拆包硬性要求，被可迭代对象中的元素数量必须要跟接收这些元素的元组的空档数一致。</li>
<li>除非用*来忽略多余元素。</li>
<li><p>
最好辨认元组拆包的形式：平行赋值：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="font-weight: bold; font-style: italic;">lax_coordinates</span> = (33.9425, -118.408)
     <span style="font-weight: bold; font-style: italic;">latitude</span>, <span style="font-weight: bold; font-style: italic;">longitude</span> = lax_coordinates <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20803;&#32452;&#25286;&#21253;</span>
     <span style="font-weight: bold;">print</span>(latitude)
</pre>
</div></li>
<li>不使用中间变量来交换也是用元组方式实现：
a, b = b, a</li>
<li><p>
还可以用*运算符把一个可迭代对象拆开：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">divmod</span>(20, 8))
     <span style="font-weight: bold; font-style: italic;">t</span> = (20, 8)
     <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">divmod</span>(*t))
     <span style="font-weight: bold; font-style: italic;">quotient</span>, <span style="font-weight: bold; font-style: italic;">remainder</span> = <span style="font-weight: bold;">divmod</span>(*t)
     <span style="font-weight: bold;">print</span>((quotient, remainder))
</pre>
</div></li>
<li><p>
元组拆包实现函数多个返回值：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">os.path.split = split(p)</span>
     <span style="font-weight: bold; font-style: italic;">#  </span><span style="font-weight: bold; font-style: italic;">Split a pathname.  Returns tuple "(head, tail)" where "tail" is</span>
     <span style="font-weight: bold; font-style: italic;">#  </span><span style="font-weight: bold; font-style: italic;">everything after the final slash.  Either part may be empty.</span>
     <span style="font-weight: bold;">import</span> os
     <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold; font-style: italic;">filename</span> = os.path.split(<span style="font-style: italic;">'/home/yjl00405/.ssh/idrsa.pub'</span>)
     <span style="font-weight: bold;">print</span>(filename)
     <span style="font-weight: bold;">print</span>(_)
</pre>
</div></li>
<li>如果是国际化软件，_可能不是一个理想占位符，因为他是gettext.gettext函数的别名。
其他情况仍是一个好的占位符。</li>
<li><p>
用 * 来处理：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; font-style: italic;">b</span>, *<span style="font-weight: bold; font-style: italic;">reset</span> = <span style="font-weight: bold;">range</span>(5)
     <span style="font-weight: bold;">print</span>((a, b, reset))
     <span style="font-weight: bold; font-style: italic;">a</span>, *<span style="font-weight: bold; font-style: italic;">reset</span>, <span style="font-weight: bold; font-style: italic;">b</span> = <span style="font-weight: bold;">range</span>(5)
     <span style="font-weight: bold;">print</span>((a, b, reset))
     *<span style="font-weight: bold; font-style: italic;">reset</span>, <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; font-style: italic;">b</span> = <span style="font-weight: bold;">range</span>(5)
     <span style="font-weight: bold;">print</span>((a, b, reset))
     <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; font-style: italic;">b</span>, *<span style="font-weight: bold; font-style: italic;">reset</span> = <span style="font-weight: bold;">range</span>(3)
     <span style="font-weight: bold;">print</span>((a, b, reset))
     <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; font-style: italic;">b</span>, *<span style="font-weight: bold; font-style: italic;">reset</span> = <span style="font-weight: bold;">range</span>(2)
     <span style="font-weight: bold;">print</span>((a, b, reset))
</pre>
</div></li>
<li><p>
嵌套元组拆包
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="font-weight: bold; font-style: italic;">metro_areas</span> = [
         (<span style="font-style: italic;">'Tokyo'</span>, <span style="font-style: italic;">'JP'</span>, 36.234, (35.345, 123.345)),
         (<span style="font-style: italic;">'Tokyo2'</span>, <span style="font-style: italic;">'JP2'</span>, 3.234, (3.345, 12.345)),
     ]

     <span style="font-weight: bold; font-style: italic;">fmt</span> = <span style="font-style: italic;">'{:15} | {:9.4f} | {:9.4f}'</span>
     <span style="font-weight: bold;">for</span> name, cc, pop, (latitude, longitude) <span style="font-weight: bold;">in</span> metro_areas:
         <span style="font-weight: bold;">print</span>(fmt.<span style="font-weight: bold;">format</span>(name, latitude, longitude))
</pre>
</div></li>
<li><p>
元组缺少一个给记录中字段命名的功能，namedtuple函数的出现可以帮我们解决这个问题：
collections.namedtuple是一个工厂函数，它可以用来构建一个带字段名的元组和一个有名字的类，
这个带名字的类对调试程序有很大的帮助。
</p>
<div class="org-src-container">
<pre class="src src-python">      <span style="font-weight: bold;">from</span> collections <span style="font-weight: bold;">import</span> namedtuple
      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#31867;&#21517;&#65292; &#31867;&#20013;&#21508;&#23383;&#27573;&#21517;</span>
      <span style="font-weight: bold; font-style: italic;">City</span> = namedtuple(<span style="font-style: italic;">'City'</span>, <span style="font-style: italic;">'name country population coordinates'</span>)
      <span style="font-weight: bold; font-style: italic;">tokyo</span> = City(<span style="font-style: italic;">'Tokyo'</span>, <span style="font-style: italic;">'JP'</span>, 36.345, (35.456, 123,345))
      <span style="font-weight: bold;">print</span>(tokyo)
      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">City(name='Tokyo', country='JP', population=36.345, coordinates=(35.456, 123, 345))</span>

      <span style="font-weight: bold;">print</span>(tokyo.population)
      <span style="font-weight: bold;">print</span>(tokyo[0])

      <span style="font-weight: bold;">print</span>(City._fields)

      <span style="font-weight: bold; font-style: italic;">LatLong</span> = namedtuple(<span style="font-style: italic;">'LatLong'</span>, <span style="font-style: italic;">'lat long'</span>)
      <span style="font-weight: bold; font-style: italic;">delhi_data</span> = (<span style="font-style: italic;">'Delhi NCR'</span>, <span style="font-style: italic;">'IN'</span>, 21.934, LatLong(28.34523, 77.20234))
      <span style="font-weight: bold; font-style: italic;">delhi</span> = City._make(delhi_data)
      <span style="font-weight: bold;">print</span>(delhi._asdict())
      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">{'name': 'Delhi NCR', 'country': 'IN', 'population': 21.934, 'coordinates': LatLong(lat=28.34523, long=77.20234)}</span>
      
      <span style="font-weight: bold;">print</span>(delhi._asdict().items())
      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">dict_items([('name', 'Delhi NCR'), ('country', 'IN'), ('population', 21.934), ('coordinates', LatLong(lat=28.34523, long=77.20234))])</span>

      <span style="font-weight: bold;">for</span> key, value <span style="font-weight: bold;">in</span> delhi._asdict().items():
          <span style="font-weight: bold;">print</span>(key+<span style="font-style: italic;">':'</span>, value)
</pre>
</div></li>
<li>_fields属性是一个包含这个类所有字段名的元组</li>
<li>_make()通过接收一个可迭代对象来生成这个类的一个实例，作用和City(*delhi_data)一样</li>
<li>_asdict()把具名元组以collections.OrderedDict的形式返回，我们可以利用它来把元组里的
信息友好呈现出来。</li>
</ol>
</div>
</div>
