2024-2-4/d42736ec4d-STDY.org
* 强大的切片以及其高级用法
1. list, str, tuple, bytes, bytearray等序列类型都支持切片操作。
2. 切片和区间会忽略最后一个元素，符合Python，C和其他语言以0作为起始下标的传统。
   #+begin_src python :results output
     s = 'bicycle'
     print(s[::3])
     print(s[::1])
     print(s[::-1]) # 相当于reverse操作
   #+end_src

   #+RESULTS:
   : bye
   : bicycle
   : elcycib
3. a:b:c这种用法只能作为索引或者下标用在[]中来返回一个切片对象：slice(a, b, c)
4. 对seq[start:stop:step]进行求值时，Python会调用seq.__getitem__(slice(start, stop, step))。
5. 切片应用：
   #+begin_src python :results output
     invoice = """
     0.....6.................................40...........52...55.........
     1909  Pimoroni PiBrella                 $17.50       3    $52.50
     1489  6mm Tactile Switch x20            $4.95        2    $9.90
     1510  Panavise Jr.-PV-201               $28.00       1    $28.00 """
     SKU = slice(0, 6)
     DESCRIPTION = slice(6, 40)
     UNIT_PRICE = slice(40, 52)
     QUANTIY = slice(52, 55)
     ITEM_TOTAL = slice(55, None)
     line_items = invoice.split('\n')[2:]

     for item in line_items:
	 print(item[UNIT_PRICE], item[DESCRIPTION])
   #+end_src

   #+RESULTS:
   : slice(40, 52, None)
   : $17.50       Pimoroni PiBrella                 
   : slice(40, 52, None)
   : $4.95        6mm Tactile Switch x20            
   : slice(40, 52, None)
   : $28.00       Panavise Jr.-PV-201

给切片赋值：
#+begin_src python :results output
  print(range(10))
  print(list(range(10)))
  # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

  l = list(range(10))
  l[2:5] = [20, 30]
  print(l)
  # [0, 1, 20, 30, 5, 6, 7, 8, 9]

  del l[5:7]
  print(l)
  # [0, 1, 20, 30, 5, 8, 9]

  l[3::2] = [11, 22]
  print(l)
  # [0, 1, 20, 11, 5, 22, 9]

  # l[2:5] = 100
  # Traceback (most recent call last):
  # File "<stdin>", line 18, in <module>
  # TypeError: can only assign an iterable

  l[2:5] = [100]
  print(l)
  # [0, 1, 100, 22, 9]
#+end_src

#+RESULTS:
: range(0, 10)
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
: [0, 1, 20, 30, 5, 6, 7, 8, 9]
: [0, 1, 20, 30, 5, 8, 9]
: [0, 1, 20, 11, 5, 22, 9]
: [0, 1, 100, 22, 9]
如果赋值对象，也就是左值是一个切片，那么赋值语句右边必须是个可迭代对象，
即便只有一个值，也要转换成可迭代对象。

