2024-2-4/d42736ec4d-STDY.html

<div id="outline-container-orgcbb3573" class="outline-2">
<h2 id="orgcbb3573"><span class="section-number-2">3.</span> 强大的切片以及其高级用法</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>list, str, tuple, bytes, bytearray等序列类型都支持切片操作。</li>
<li><p>
切片和区间会忽略最后一个元素，符合Python，C和其他语言以0作为起始下标的传统。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">'bicycle'</span>
     <span style="font-weight: bold;">print</span>(s[::3])
     <span style="font-weight: bold;">print</span>(s[::1])
     <span style="font-weight: bold;">print</span>(s[::-1]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#30456;&#24403;&#20110;reverse&#25805;&#20316;</span>
</pre>
</div></li>
<li>a:b:c这种用法只能作为索引或者下标用在[]中来返回一个切片对象：slice(a, b, c)</li>
<li>对seq[start:stop:step]进行求值时，Python会调用seq.__getitem__(slice(start, stop, step))。</li>
<li><p>
切片应用：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="font-weight: bold; font-style: italic;">invoice</span> = <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">     0.....6.................................40...........52...55.........</span>
<span style="font-style: italic;">     1909  Pimoroni PiBrella                 $17.50       3    $52.50</span>
<span style="font-style: italic;">     1489  6mm Tactile Switch x20            $4.95        2    $9.90</span>
<span style="font-style: italic;">     1510  Panavise Jr.-PV-201               $28.00       1    $28.00 """</span>
     <span style="font-weight: bold; font-style: italic;">SKU</span> = <span style="font-weight: bold;">slice</span>(0, 6)
     <span style="font-weight: bold; font-style: italic;">DESCRIPTION</span> = <span style="font-weight: bold;">slice</span>(6, 40)
     <span style="font-weight: bold; font-style: italic;">UNIT_PRICE</span> = <span style="font-weight: bold;">slice</span>(40, 52)
     <span style="font-weight: bold; font-style: italic;">QUANTIY</span> = <span style="font-weight: bold;">slice</span>(52, 55)
     <span style="font-weight: bold; font-style: italic;">ITEM_TOTAL</span> = <span style="font-weight: bold;">slice</span>(55, <span style="font-weight: bold; text-decoration: underline;">None</span>)
     <span style="font-weight: bold; font-style: italic;">line_items</span> = invoice.split(<span style="font-style: italic;">'</span><span style="font-weight: bold; text-decoration: underline;">\n</span><span style="font-style: italic;">'</span>)[2:]

     <span style="font-weight: bold;">for</span> item <span style="font-weight: bold;">in</span> line_items:
         <span style="font-weight: bold;">print</span>(item[UNIT_PRICE], item[DESCRIPTION])
</pre>
</div></li>
</ol>

<p>
给切片赋值：
</p>
<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">range</span>(10))
  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">range</span>(10)))
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]</span>

  <span style="font-weight: bold; font-style: italic;">l</span> = <span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">range</span>(10))
  <span style="font-weight: bold; font-style: italic;">l</span>[2:5] = [20, 30]
  <span style="font-weight: bold;">print</span>(l)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[0, 1, 20, 30, 5, 6, 7, 8, 9]</span>

  <span style="font-weight: bold;">del</span> l[5:7]
  <span style="font-weight: bold;">print</span>(l)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[0, 1, 20, 30, 5, 8, 9]</span>

  <span style="font-weight: bold; font-style: italic;">l</span>[3::2] = [11, 22]
  <span style="font-weight: bold;">print</span>(l)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[0, 1, 20, 11, 5, 22, 9]</span>

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">l[2:5] = 100</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Traceback (most recent call last):</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">File "&lt;stdin&gt;", line 18, in &lt;module&gt;</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">TypeError: can only assign an iterable</span>

  <span style="font-weight: bold; font-style: italic;">l</span>[2:5] = [100]
  <span style="font-weight: bold;">print</span>(l)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[0, 1, 100, 22, 9]</span>
</pre>
</div>
<p>
如果赋值对象，也就是左值是一个切片，那么赋值语句右边必须是个可迭代对象，
即便只有一个值，也要转换成可迭代对象。
</p>
</div>
</div>
