2024-2-4/d42736ec4d-STDY.org
* 对序列使用 + 和 *
#+begin_src python :results output
  l = list(range(3))
  print(l)
  # [0, 1, 2]

  print(l * 3)
  # [0, 1, 2, 0, 1, 2, 0, 1, 2]

  print(5 * 'abcde')
  # abcdeabcdeabcdeabcdeabcde
#+end_src

#+RESULTS:
: [0, 1, 2]
: [0, 1, 2, 0, 1, 2, 0, 1, 2]
: abcdeabcdeabcdeabcdeabcde
1. 注意容器序列中的引用
#+begin_src python :results output
  board = [['_'] * 3 for i in range(3)]
  print(board)
  # [['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]

  board[1][2] = 'X'
  print(board)
  # [['_', '_', '_'], ['_', '_', 'X'], ['_', '_', '_']]
#+end_src

#+RESULTS:
: [['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]
: [['_', '_', '_'], ['_', '_', 'X'], ['_', '_', '_']]

#+begin_src python :results output
  weird_board = [['_'] * 3] * 3
  print(weird_board)
  # [['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]

  weird_board[1][2] = 'O'
  print(weird_board)
  # [['_', '_', 'O'], ['_', '_', 'O'], ['_', '_', 'O']]
#+end_src

#+RESULTS:
: [['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]
: [['_', '_', 'O'], ['_', '_', 'O'], ['_', '_', 'O']]

#+begin_src python :results output
  print(type('_'))
  # <class 'str'>

  board = ['_']
  print(id(board[0]))
  print([board * 3])
  print([id(idx) for idx in board * 3])
  tmp = board * 3
  print(tmp)
  print([id(idx) for idx in tmp])
  tmp[0] = 'Q'
  print(tmp)
  print([id(idx) for idx in tmp])

  board1 = [['_'] * 3] * 3
  board2 = [['_'] * 3 for i in range(3)]
  print(board1)
  print([id(idx) for idx in board1])
  print(board2)
  print([id(idx) for idx in board2])

  row = ['_'] * 3
  board3 = []
  for i in range(3):
      board3.append(row)
  print(board3)
  print([id(idx) for idx in board3])

  board4 = []
  for i in range(3):
      row = ['_'] * 3
      board4.append(row)
  print(board4)
  print([id(idx) for idx in board4])
#+end_src

#+RESULTS:
#+begin_example
<class 'str'>
140229860342256
[['_', '_', '_']]
[140229860342256, 140229860342256, 140229860342256]
['_', '_', '_']
[140229860342256, 140229860342256, 140229860342256]
['Q', '_', '_']
[140229858517616, 140229860342256, 140229860342256]
[['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]
[140229858519488, 140229858519488, 140229858519488]
[['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]
[140229858519232, 140229858519040, 140229858518976]
[['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]
[140229858518848, 140229858518848, 140229858518848]
[['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]
[140229858518592, 140229858518464, 140229858518400]
#+end_example

* 序列增量赋值 += 和 *=
1. 增量赋值运算符+= 和 *=取决于他们的第一个操作对象。
2. += 背后的特殊方法是__iadd__，用于‘就地加法’，如果没有实现，就会调用__add__。
3. 对可变序列来说，a += b中a会就地改变，和调用a.extend(b)一样。
4. 如果a没有实现__iadd__，那么a+=b == a=a+b，也就是会生成新的对象给a。
5. 变量名会不会关联到新的对象，完全取决于这个类型有没有实现__iadd__这个方法。
6. 可变序列一半都实现了__iadd__方法。不可变序列根本不支持此类操作。
7. *= 对应的是 __imul__。
#+begin_src python :results output
  l = list(range(3))
  print(id(l))
  l *= 2
  print(id(l))

  t = tuple(range(3))
  print(id(t))
  t *= 2
  print(id(t))
#+end_src   

#+RESULTS:
: 140667941147328
: 140667941147328
: 140667941299904
: 140667941716224
