2024-2-4/d42736ec4d-STDY.html

<div id="outline-container-org6446fab" class="outline-2">
<h2 id="org6446fab"><span class="section-number-2">4.</span> 对序列使用 + 和 *</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold; font-style: italic;">l</span> = <span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">range</span>(3))
  <span style="font-weight: bold;">print</span>(l)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[0, 1, 2]</span>

  <span style="font-weight: bold;">print</span>(l * 3)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[0, 1, 2, 0, 1, 2, 0, 1, 2]</span>

  <span style="font-weight: bold;">print</span>(5 * <span style="font-style: italic;">'abcde'</span>)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">abcdeabcdeabcdeabcdeabcde</span>
</pre>
</div>
<ol class="org-ol">
<li>注意容器序列中的引用</li>
</ol>
<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold; font-style: italic;">board</span> = [[<span style="font-style: italic;">'_'</span>] * 3 <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(3)]
  <span style="font-weight: bold;">print</span>(board)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]</span>

  board[1][2] = <span style="font-style: italic;">'X'</span>
  <span style="font-weight: bold;">print</span>(board)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[['_', '_', '_'], ['_', '_', 'X'], ['_', '_', '_']]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold; font-style: italic;">weird_board</span> = [[<span style="font-style: italic;">'_'</span>] * 3] * 3
  <span style="font-weight: bold;">print</span>(weird_board)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[['_', '_', '_'], ['_', '_', '_'], ['_', '_', '_']]</span>

  weird_board[1][2] = <span style="font-style: italic;">'O'</span>
  <span style="font-weight: bold;">print</span>(weird_board)
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[['_', '_', 'O'], ['_', '_', 'O'], ['_', '_', 'O']]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">type</span>(<span style="font-style: italic;">'_'</span>))
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&lt;class 'str'&gt;</span>

  <span style="font-weight: bold; font-style: italic;">board</span> = [<span style="font-style: italic;">'_'</span>]
  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">id</span>(board[0]))
  <span style="font-weight: bold;">print</span>([board * 3])
  <span style="font-weight: bold;">print</span>([<span style="font-weight: bold;">id</span>(idx) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> board * 3])
  <span style="font-weight: bold; font-style: italic;">tmp</span> = board * 3
  <span style="font-weight: bold;">print</span>(tmp)
  <span style="font-weight: bold;">print</span>([<span style="font-weight: bold;">id</span>(idx) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> tmp])
  <span style="font-weight: bold; font-style: italic;">tmp</span>[0] = <span style="font-style: italic;">'Q'</span>
  <span style="font-weight: bold;">print</span>(tmp)
  <span style="font-weight: bold;">print</span>([<span style="font-weight: bold;">id</span>(idx) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> tmp])

  <span style="font-weight: bold; font-style: italic;">board1</span> = [[<span style="font-style: italic;">'_'</span>] * 3] * 3
  <span style="font-weight: bold; font-style: italic;">board2</span> = [[<span style="font-style: italic;">'_'</span>] * 3 <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(3)]
  <span style="font-weight: bold;">print</span>(board1)
  <span style="font-weight: bold;">print</span>([<span style="font-weight: bold;">id</span>(idx) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> board1])
  <span style="font-weight: bold;">print</span>(board2)
  <span style="font-weight: bold;">print</span>([<span style="font-weight: bold;">id</span>(idx) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> board2])

  <span style="font-weight: bold; font-style: italic;">row</span> = [<span style="font-style: italic;">'_'</span>] * 3
  <span style="font-weight: bold; font-style: italic;">board3</span> = []
  <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(3):
      board3.append(row)
  <span style="font-weight: bold;">print</span>(board3)
  <span style="font-weight: bold;">print</span>([<span style="font-weight: bold;">id</span>(idx) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> board3])

  <span style="font-weight: bold; font-style: italic;">board4</span> = []
  <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(3):
      <span style="font-weight: bold; font-style: italic;">row</span> = [<span style="font-style: italic;">'_'</span>] * 3
      board4.append(row)
  <span style="font-weight: bold;">print</span>(board4)
  <span style="font-weight: bold;">print</span>([<span style="font-weight: bold;">id</span>(idx) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> board4])
</pre>
</div>
</div>
</div>

<div id="outline-container-org70f73c5" class="outline-2">
<h2 id="org70f73c5"><span class="section-number-2">5.</span> 序列增量赋值 += 和 *=</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>增量赋值运算符+= 和 *=取决于他们的第一个操作对象。</li>
<li>+= 背后的特殊方法是__iadd__，用于‘就地加法’，如果没有实现，就会调用__add__。</li>
<li>对可变序列来说，a += b中a会就地改变，和调用a.extend(b)一样。</li>
<li>如果a没有实现__iadd__，那么a+=b == a=a+b，也就是会生成新的对象给a。</li>
<li>变量名会不会关联到新的对象，完全取决于这个类型有没有实现__iadd__这个方法。</li>
<li>可变序列一半都实现了__iadd__方法。不可变序列根本不支持此类操作。</li>
<li>*= 对应的是 __imul__。</li>
</ol>
<div class="org-src-container">
<pre class="src src-python">  <span style="font-weight: bold; font-style: italic;">l</span> = <span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">range</span>(3))
  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">id</span>(l))
  <span style="font-weight: bold; font-style: italic;">l</span> *= 2
  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">id</span>(l))

  <span style="font-weight: bold; font-style: italic;">t</span> = <span style="font-weight: bold;">tuple</span>(<span style="font-weight: bold;">range</span>(3))
  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">id</span>(t))
  <span style="font-weight: bold; font-style: italic;">t</span> *= 2
  <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">id</span>(t))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
